{
    "welcome_message": "Willkommen auf der Profilseite",
    "about": "Über",
    "experience": "Erfahrung",
    "education": "Ausbildung",
    "skills": "Fähigkeiten",
    "projects": "Projekte",
    "languages":"Sprachen",
    "profileHeader": {
        "downloadButton": "Als PDF herunterladen",
        "generatingPDF": "PDF wird generiert ..."
    },
    "accomplishments": "Leistungen",
    "profile": {
        "name": "Ali Rajab",
        "headline": "Software Engineer II | Produktmanager | Mobile App-Entwickler | Flutter | Java | Webentwickler | Laravel | React.js | Vue.js | Junior Blockchain-Entwickler | Solidity | Python",
        "location": "Gouvernement Hama, Syrien",
        "contact": {
        "email": "alirajab.dev@gmail.com",
        "phone": "+963-992840260",
        "linktree": "https://linktr.ee/alirajab"
        },
        "summary": "Ergebnisorientierter Software-Ingenieur mit über 4 Jahren Berufserfahrung in der Softwarebranche. Ich verfüge über eine nachgewiesene Erfolgsbilanz in der Softwareentwicklung in verschiedenen Bereichen, einschließlich Liefer-, Reise- und Informationsmanagementsystemen. Ich zeichne mich durch Teamleitung, die Entwicklung kosteneffizienter Lösungen und die Steigerung der Produktivität durch effektives Projektmanagement und klare Kommunikation aus. Meine technische Expertise umfasst die Entwicklung von mobilen Anwendungen, Webentwicklung und Servermanagement, mit einem starken Fokus auf die Bereitstellung hochwertiger, skalierbarer Systeme. Ich bin leidenschaftlich daran interessiert, an Projekten zu arbeiten, die eine signifikante Auswirkung haben und Millionen von Nutzern zugute kommen. Mein kollaborativer Ansatz in Kombination mit meinen technischen Fähigkeiten ermöglicht es mir, Lösungen zu schaffen, die die Benutzererfahrung und die betriebliche Effizienz verbessern.<br><br>Meine technische Expertise erstreckt sich über die Entwicklung mobiler Anwendungen, Webentwicklung und Servermanagement, mit einem starken Fokus auf die Bereitstellung hochwertiger, skalierbarer Systeme. Ich bin leidenschaftlich daran interessiert, an Projekten zu arbeiten, die eine signifikante Auswirkung haben und Millionen von Nutzern zugute kommen. Mein kollaborativer Ansatz in Kombination mit meinen technischen Fähigkeiten ermöglicht es mir, Lösungen zu schaffen, die die Benutzererfahrung und die betriebliche Effizienz verbessern.<br><br>Meine technische Expertise erstreckt sich über die Entwicklung mobiler Anwendungen, Webentwicklung und Datenbankmanagement, mit einem starken Fokus auf die Bereitstellung hochwertiger, skalierbarer Systeme.<br><br>Ich bin leidenschaftlich daran interessiert, an Projekten zu arbeiten, die eine signifikante Auswirkung haben und Millionen von Nutzern zugute kommen.<br><br>Mein kollaborativer Ansatz in Kombination mit meinen technischen Fähigkeiten ermöglicht es mir, Lösungen zu schaffen, die die Benutzererfahrung und die betriebliche Effizienz verbessern.<br><br><b>Kernkompetenzen:</b><br>Projektmanagement: Agile Methoden, ClickUp, Jira<br>Mobile Entwicklung: Flutter, Dart, Java, UI/UX-Design, REST-API-Integration, Firebase<br>Webentwicklung: C#, .Net core, PHP, Laravel, JavaScript, Node.js, Vue.js, HTML/CSS, AWS<br>Datenbankmanagement: SQL Server, MySQL, SQLite, PostgreSQL, MongoDB<br><br>Fließend in Arabisch und Englisch, ich bin dem kontinuierlichen Lernen und der beruflichen Weiterentwicklung verpflichtet.<br><br>Für mehr über meine Arbeit und um sich zu vernetzen, besuchen Sie mein <a href='https://linktr.ee/alirajab'>Linktree</a>.",
        "experience": [
            {
            "job_title": "Technischer Projektleiter",
            "company": "Axis X Group",
            "duration": "08/2023 – 02/2024",
            "location": "Erbil, Irak",
            "description": "• Führung und Mentoring von funktionsübergreifenden Teams (Mobile, Frontend, Backend) bei der Umsetzung von Funktionen in 3 mobilen Apps und 1 Website, was zu einer Produktivitätssteigerung von 75 % und einem Benutzerwachstum von 50 % führte. <br><br>• Effizientes Projektmanagement mit ClickUp organisiert und das Git-Repository-Management für mehrere Codebasen optimiert, um die Zusammenarbeit im Team zu verbessern und die Bereitstellungszeit von Funktionen um 80 % zu verkürzen. <br><br>• Stakeholder-Anforderungen in technische Spezifikationen umgesetzt und dabei auf hochwirksame Funktionen priorisiert, die die Support-Anrufe von Kunden (Händler, Kunden, Lieferanten) um 90 % reduzierten. <br><br>• Optimierte Systemarchitektur durch Refactoring von über 10 kritischen APIs, wodurch die Serverlast um 80 % reduziert wurde. <br><br>• Kosteneffiziente Lösungen implementiert, darunter die Einführung von OTP (Einmalpasswort), wodurch monatlich $1000 eingespart und gleichzeitig hohe Sicherheitsstandards beibehalten wurden. <br><br>- Tech: ClickUp, Flutter, Laravel, Linux, GitHub, JMeter, GetX, Google Maps, Firebase."
            },
            {
            "job_title": "Mobile App-Entwickler",
            "company": "Balafrreen",
            "duration": "12/2022 – 08/2023",
            "location": "Erbil, Irak",
            "description": "• Erhöhte die Datenzugänglichkeit um 80 % und reduzierte die Serverlatenz um 50 % durch Backend- und Cloud-Optimierungen. <br><br>• Über 10.000 Zeilen von Flugdaten, Flughafendaten und Flugliniendaten verarbeitet und optimiert, wodurch die Reaktionszeiten der App um 90 % verbessert wurden. <br><br>• Eine 35 %ige Steigerung der Benutzerbasis der App durch die Implementierung von Social-Sign-In-Optionen (Google, Apple, Facebook) erreicht. <br><br>• Den gesamten Lebenszyklus der App vom Entwicklung bis zur Veröffentlichung im App Store und bei Google Play verwaltet und so eine nahtlose Benutzererfahrung sichergestellt. <br><br>• Tech: Flutter, BloC, Clean Architecture, AWS, JavaScript, XCode, HIVE."
            },
            {
            "job_title": "Junior Software-Ingenieur",
            "company": "The General Electricity Company",
            "duration": "11/2019 – 07/2020",
            "location": "Homs, Syrien",
            "description": "• Entwarf mehr als 5 UML- und ERD-Diagramme, was die Komplexität der Systemarchitektur um 30% reduzierte.<br><br>• Verkürzte die Entwicklungszeit um 50% durch effiziente Backend- und Frontend-Implementierung in einem 2-Personen-Team.<br><br>• Integrierte FCM, was zu einer Reduzierung der Folge-Anrufe um 40% und einer Steigerung der Kundenzufriedenheitswerte um 50% führte.<br><br>- Technologien: Ionic Framework, Visual Paradigm, MySQL, Laravel, Firebase Cloud Messaging (FCM)."
            }
        ],
        "education": [
        {
            "degree": "MPhil, Software Engineering und Informationssysteme",
            "institution": "Universität Damaskus",
            "duration": "März 2021 - September 2022 (Nicht abgeschlossen)"
        },
        {
            "degree": "Bachelor, Information Engineering",
            "institution": "Al-Baath Universität",
            "duration": "September 2015 - Oktober 2020"
        }
        ],
        "skills": {
        "Projektmanagement": {
            "Proficient": ["Teamführung", "Agile", "ClickUp"],
            "Familiar": ["Jira"]
        },
        "Mobile App-Entwicklung": {
            "Proficient": ["Flutter", "Dart", "Java", "UI/UX-Design", "REST API-Integration", "Firebase", "Google Play", "App Store", "App Gallery", "POS (SUNMI)", "Figma", "XCode", "JSON"],
            "Familiar": ["Swift", "Objective-C"]
        },
        "Webentwicklung": {
            "Proficient": ["C#", ".Net Core", "Postman", "PHP", "Laravel", "JavaScript", "Node.js", "Vue.js", "HTML/CSS", "Bootstrap", "Tailwind CSS", "Linux", "Serveradministration", "AWS", "Git", "Github", "Gitlab", "Pinia"],
            "Familiar": ["Typescript", "React.js", "Next.js"]
        },
        "Datenbankmanagement": {
            "Proficient": ["SQL Server", "MSSQL", "MySQL", "SQLite", "PostgreSQL", "MongoDB"]
        }
        },
        "projects": [
            {
              "title": "Flight Ticket Reservation System",
              "description": "- Ein Dashboard erstellt, das Administratoren ermöglicht, Flüge, Reservierungen, Benutzer und deren Rollen zu verwalten (+3).<br><br> - Nutzern ermöglicht, nach Flügen zu suchen, Reservierungen vorzunehmen und ihre Reservierungen zu verwalten.<br><br> - Den Code-First-Ansatz verwendet, um eine Datenbank mit 6+ Tabellen in MSSQL zu entwerfen und zu verwalten.<br><br> - Das Razor-Seitenmodell implementiert, um 15+ Webseiten und deren zugehörige Logik zu verwalten.<br><br> - Mehrsprachige Unterstützung für Arabisch und Englisch hinzugefügt, um eine vielfältige Benutzerbasis zu bedienen.",
              "githubLink": "",
              "liveLink": "",
              "technologies": [".NET 6 (cross-platform)", "Bootstrap", "HTML","CSS","JS","SQL Server"]
            },
            {
                "title": "Your Store",
                "description": "- Umfassende E-Commerce-Mobile-App: Entwickelte eine funktionsreiche mobile Anwendung für E-Commerce mit Flutter.<br><br> - Produktsuche: Integrierte eine leistungsstarke Suchfunktion, die es den Benutzern ermöglicht, Produkte leicht zu finden.<br><br> - Favoritenverwaltung: Ermöglichte es den Benutzern, ihre Favoriten mühelos zu verwalten.<br><br> - Bestell und Warenkorbverwaltung: Bot nahtlose Bestellabwicklung und Warenkorbverwaltungsfunktionen.<br><br> - Bloc Design Pattern: Nutze das Bloc-Designmuster, um eine effiziente und skalierbare Verwaltung der Geschäftslogik der App zu gewährleisten.",
                "githubLink": "https://github.com/AliRajab12/flutter_ecommerce_app",
                "liveLink": "https://www.youtube.com/watch?v=rD8zsHczDuM&list=PLVHI1VUbMtuItLu2XErbvLjB3-k8h78ny&index=2",
                "technologies": ["Flutter", "Dart", "SQLite","Figma"]
              }
          ],
        "accomplishments": {
        "certifications": [
            "IBM Data Science Professional Certificate",
            "Dankesschreiben von der Allgemeinen Elektrizitätsgesellschaft"
        ]
        },
        "languages": [
            "Arabisch",
            "Englisch"
        ]
    }
}
